/**
*
* Предположим, ваша компа ния выпускает два продукта: рубашки и сумки. 
* На рубашку требуется 1 м ткани и 5 пуговиц. 
* На изготовление сумки необходимо 2 м ткани и 2 пуго вицы. 
* У вас есть 11 м ткани и 20 пуговиц. 
* Рубашка приносит прибыль $2, а сумка - $3. 
* Сколько рубашек и сумок следует изготовить для получения максимальной прибыли?
**/

// task 2
/**
* вы политик, пытающийся получить максимальное ко­ личество голосов. Исследования показали, что на каждый голос жителя Сан-Франциско требуется примерно час работы (маркетинг, . rсследования и т. д.), а на каждый голос жителя Чикаго - 1,5 часа. Вам нужны голоса как минимум 500 жителей Сан-Франциско и как минимум 300 жителей Чикаго. В вашем распоряжении 50 дней. Кроме того, затраты на жителя Сан-Франциско составляют $2, а на жителя Чикаго - $1. Ваш бюджет составляет $1500. Какое максимальное количество голосов вы сможете получить (Сан-Франциско+Чикаго)
**/
